{"data":{"post":{"title":"Jak ugryźć code review.","date":"12 July, 2019","content":"<p>W zamierzchłych czasach, gdy zaczynałem programować i pisałem swoje pierwsze projekty, bałem się przedstawić kawałek swojego kodu w obawie, że będzie kiepski i zostanę wyśmiany. Code review napawało mnie strachem przed tym że zbłaźnię się pokazując swój projekt. Często też tłumaczyłem swój strach wmawiając sobie, że przecież jestem dobrym programistą, a mój kod jest nie tylko czytelny dla drugiej osoby, ale też używam dobrych praktyk programując. Nie wszystko okazało się prawdą z perspektywy czasu, a ściślej biorąc nic.</p>\n<h1 id=\"pierwsze-obawy\"><a href=\"#pierwsze-obawy\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Pierwsze obawy</h1>\n<p>Gdy pierwszy raz chcesz pokazać komuś kawałek swojej pracy masz obawy, że zostaniesz skrytykowany za swoją niewiedzę, że być może ktoś powie, iż nie nadajesz się do wykonywania\ntej pracy, czynności etc. Jest mnóstwo myśli, które mówią, że nie jesteś dobry w tym co robisz.\nZanim pokazałem swój pierwszy projekt to często się wahałem i często się zastanawiałem, czy rzeczywiście warto pokazać swój kod nad którym spędziłem ostatni tydzień lub nawet tygodnie.\nJest mnóstwo irracjonalnych obaw, które nie pozwalają nam zrobić kroku do przodu i zatrzymują nas w miejscu, ale największy problem polega na tym że te myśli wcale nie wydają się w danym momencie irracjonalne, ale wydają się racjonalnymi argumentami, które rzeczywiście mogą\nmieć rację bytu i przeważyć szalę.</p>\n<p>##krok naprzód</p>\n<p>Zdecydowanie warto jednak spróbować bo tak naprawdę<br>\nnie mamy nic do stracenia. Ciężko sobie czasem uświadomić, że kod który piszesz jest nieidealny i wiele mu brakuje, ale jak sobie to uświadomisz to zrobisz spory krok do przodu i będziesz mógł bardziej rozwinąć skrzydła. Prawda jest też taka, że wierzę, iż nawet programiści z wieloletnim doświadczeniem też mogą napisać coś co nie będzie w duchu z najlepszymi praktykami. Jesteśmy tylko ludźmi i możemy się mylić albo coś sknocić. Warto też wiedzieć, że seniorzy raczej też nie są wszechwiedzący jak często uważają osoby,które dopiero zaczynają swoją karierę.</p>\n<h2 id=\"dlaczego-wart-korzystać-z-code-review\"><a href=\"#dlaczego-wart-korzysta%C4%87-z-code-review\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Dlaczego wart korzystać z Code review?</h2>\n<p>Dzięki temu że bardziej doświadczony programista spojrzy na mój kod i przedstawi jego niedoskonałości będę miał możliwość nauki na swoich błędach, ale też będę mógł dowiedzieć się nieco więcej na temat moich słabych stron jeżeli chodzi o samo programowanie. Tak naprawdę uczymy się na błędach, a code review sprawia, że wiemy co musimy jeszcze przepracować i na co zwrócić szczególną uwagę. Poprzez code review poznajemy też punkt widzenia osoby bardziej doświadczonej i to pozwala nam spojrzeć z szerszej perspektywy na to czym się zajmujemy. Tego typu recenzja to też wychodzenie z swojej strefy komfortu co jest ogromnym plusem.</p>\n<p>##Kiedy nie warto się przejmować</p>\n<p>Warto jednak pamiętać, że tylko konstruktywna krytyka czyjejś pracy jest pomocna. Jeżeli natrafiłbyś na sytuację w której ktoś krytykuje zajadle Twoją pracę i nie jest w tym momencie\nmerytoryczny, a czasem wręcz krytykancki to zdecydowanie nie ma się czym przejmować.\nUważam, że hejt należy olać, a wartościową krytykę przyjąć do serca i pamiętać o niej,\ngdy zaczynamy pracę nad nowym projektem.</p>\n","image":"./images/audit-3737447_1920"}},"context":{}}