{"data":{"post":{"title":"Technologie z których korzystam.","date":"7 lipca, 2019","content":"<h1 id=\"coś-na-dobry-początek-pisania-o-programowaniu\"><a href=\"#co%C5%9B-na-dobry-pocz%C4%85tek-pisania-o-programowaniu\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Coś na dobry początek pisania o programowaniu.</h1>\n<p>Dzisiejszym tematem przewodnim są technologie z których korzystam podczas pisania swoich projektów. Moim celem na tą chwilę jest przybliżenie tego czym się zajmuję programując własne projekty i przede wszystkim dlaczego wybrałem te, a nie inne technologie?</p>\n<p>Pisząc obecnie posty mam zamiar po prostu przedstawić jakieś podstawowe informacje na mój temat i tego co robię.\nMyślę, że to dobry wstęp. Jednak w najbliższym czasie na pewno będzie można liczyć na jakieś posty stricte związane z wiedzą techniczną.</p>\n<h2 id=\"trochę-o-mojej-przeszłości-programistycznej\"><a href=\"#troch%C4%99-o-mojej-przesz%C5%82o%C5%9Bci-programistycznej\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Trochę o mojej przeszłości programistycznej</h2>\n<p>Przechodząc do dzisiejszego tematu, na początek warto wspomnieć, że zajmuję się Front Endem.\nW przeszłości pracowałem jako programista gier komputerowych i przez pewien czas pisałem projekty Back-Endowe w Pythonie, django.</p>\n<p>Front-End jest jednak czymś co mnie najbardziej interesuje i w wrześniu tego roku miną 2 lata jak zagłębiam się w tej dziedzinie. W przyszłości myślę, że będę chciał jednak nie tylko pisać projekty związane z Front-Endem ale też projekty Back Endowe. Daję sobie jakiś czas nim zacznę się zajmować i jednym i drugim.</p>\n<h2 id=\"dlaczego-akurat-front\"><a href=\"#dlaczego-akurat-front\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Dlaczego akurat Front?</h2>\n<p>Front daje mnóstwo okazji do napisania swoich aplikacji, które nie tylko dają możliwość zakodowania odpowiedniego działania mechanizmów, funkcjonalności etc. ale też mogą wyglądać, możemy dodawać animacje, które mogą zachwycać i strona wizualna jest tu równie ważna co strona samego działania aplikacji.</p>\n<p>Dla przykładu można podać choćby Google Sheets, które działa jak pakiet biurowy office. Wiadomo, że w wymienionym przypadku dużą część odgrywa też backend, ale to w jaki sposób jest wyświetlany arkusz kalkulacyjny, w jaki sposób jest zrealizowane sumowanie wartości, w jaki sposób jest zrealizowana komunikacja między przeglądarką użytkownika, a bazą danych za to wszystko jest odpowiedzialny Front End developer i właśnie z tego względu jest to takie kuszące.</p>\n<p>Pamiętam, że chciałem kiedyś pisać aplikacje desktopowe, ale, że programowałem w owym czasie w Pythonie to nie było w nim biblioteki, która mogłaby mi się przydać(swoją drogą PyQt jest dość słabe). Javascript możemy nie tylko wykorzystywać do programowania stron, ale też do programowania aplikacji natywnych (React Native, Native Script) albo właśnie desktopowych(Electron). Js daje mnóstwo możliwość choć na początku wydawało mi się zupełnie na odwrót.</p>\n<h2 id=\"w-jakich-technologiach-programuję\"><a href=\"#w-jakich-technologiach-programuj%C4%99\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>W jakich technologiach programuję</h2>\n<p>Jeżeli chodzi o język programowania to trudno nie używać na Froncie Javascriptu, no chyba że mówimy o Typescript, który swoją drogą jest transpilowany do JS. Jeżeli chodzi o odwieczny bój\nbibliotek niezbędnych do pisania interfejsów użytkownika czyli React, Angular i vue to najbardziej z tej trójki interesuje mnie zdecydowanie Vue oraz React w drugiej kolejności.Z każdym z tych frameworków miałem styczność.</p>\n<p>Oczywiście programując projektyFront-endowe często wykorzystuję CSS i HTML od których na dobrą sprawę zacząłem przygodę z programowaniem w tym obszarze. Jeżeli chodzi o frameworki css to kiedyś korzystałem z Bootstrapa, ale szczerze powiedziawszy to częśćiej wolę pisać własne style nie korzystając z dobrodziejstwa frameworków.</p>\n<p>Od jakiegoś czasu też staram się wykorzystywać metodologię Bem w swoich projektach. Bem jest metodologią, którą można też postrzegać jako sposób tworzenia architektury samej aplikacji, myślę, że za jakiś czas pokuszę się o napisanie czegoś więcej na ten temat. Bem bardzo mocno przydaje mi się podczas pisania stylów.</p>\n<p>Wracając jeszcze do css to od pisania\nstylów w czystym cssie, wolę wykorzystanie preprocesora Sass, który sprawia, że pisanie stylów znów jest przyjemne i co najważniejsze style są bardziej czytelne i łatwiej jest się w nich połapać.\nCzęsto też korzystam z webpacka i dostępnych do niego wtyczek.</p>\n<p>Kiedyś często też korzystałem z Grunta, który pomaga zautomatyzować pewne powtarzalne zadania.</p>\n<p>Jak każdy programista korzystam też z gita, który jest niezastąpionym narzędziem jeżeli chodzi o pracę z repozytorium.</p>\n<p>Jako IDE kiedyś wykorzystywałem Webstorma, ale prawdę powiedziawszy wolę jednak Visual studio code i to z niego na ogół korzystam pracując.</p>\n<p>Sporo jest narzędzi, któpre stosuję, za jakiś czas postaram się nieco przybliżyć jak można z nich korzystać albo w jaki sposób mi się przydały. To by było na tyle.</p>\n","image":{"type":"image","mimeType":"image/jpeg","src":"/assets/static/office-1209640_1920.0b85c65.da7ba2a.jpg","size":{"width":1920,"height":1281},"sizes":"(max-width: 1920px) 100vw, 1920px","srcset":["/assets/static/office-1209640_1920.1b91758.da7ba2a.jpg 480w","/assets/static/office-1209640_1920.3df3210.da7ba2a.jpg 1024w","/assets/static/office-1209640_1920.0b85c65.da7ba2a.jpg 1920w"],"dataUri":"data:image/svg+xml,%3csvg fill='none' viewBox='0 0 1920 1281' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink'%3e%3cdefs%3e%3cfilter id='__svg-blur-9'%3e%3cfeGaussianBlur in='SourceGraphic' stdDeviation='40'/%3e%3c/filter%3e%3c/defs%3e%3cimage x='0' y='0' filter='url(%23__svg-blur-9)' width='1920' height='1281' xlink:href='data:image/jpeg%3bbase64%2c/9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAArAEADASIAAhEBAxEB/8QAGwAAAgIDAQAAAAAAAAAAAAAABQYEBwECAwj/xAA3EAACAQMCBAQCCAUFAAAAAAABAgMEBREAIQYSMVETIkFhB5EUJDJCYnGBoRUjNEOxcpKi0eH/xAAYAQEBAQEBAAAAAAAAAAAAAAADAgQBBf/EACARAAICAwACAwEAAAAAAAAAAAABAhEDEiExQQQygfD/2gAMAwEAAhEDEQA/AE/hgVCor1KRrToQjoo3TJ2bPbOB%2bumm0UEd4v8AX21rlU07RBXWONzHsR6YAJ3x6%2busUVLHHSiSnjSriziemYncDqNvTSvHWXNeN4rvRW%2bUwREQ1EaEsqpvtnqfLg576fVRak/AE24x1XS/bTbYbZT09J4zVDpGCXdSD1O2fX88576YKfw1A8o1XMnGFIbvRW2kleqdGBlljwUSNhuzN7bHHXbTTQXehqp0hp66N3Y4UcrDJ%2bWplHoNNqxhlMbDoNCqyGNzgJknYADrrq7xKOVqyAzEgCJWBJJ6Ab6iXGrntVVAiqXkn8kMkYDh27A%2bh/zvqNkhIYpN0C%2bJWi4fstRNzKtVKvKcYymR0/7/APNJhp7fNTPc55x47USusiDeFMBeVfxMdj7A6m8UcP36%2b3QpdaWWCjjP9vztN/pI6DvncfvqDHZFlqoaCNHpqJUHivhgiIhJwe5JOAO%2b%2bkhJLhbjSBFiSSW5JTU78jtuD2HqffRy6iKO60b08iQUcX1eomJ5QQx2kJ7K3U9mOhsF0hiVnjijSTGGwMZHbUuqrYKy3nxAYqeReQqqeVh0I6eo0e1rVmrR3aMw8FXCOpkpOH6i3NBUyliREJASd93Vt1H7aPW3gjiyyVyVsVTaqiMIwkjigbxFyMeXmbGffrjONa8DcQnhq3GGvt00lTCvLEsSkuYTur8iqTkjAPTce%2bmCo%2bKMEIQyWK8Ybf8Ap32/46lbvhmyOMWuL%2b/RSp%2bEuKRV/Saa0UUM7lQ1RVznIULjHKBseu476N2XgriWhYzT8TU9PGKo1jRR0eY1bGCPMwwuO2NyTorZviTFeJpIoLHcomiAP1hPD5vyyN9TrjxZW0680NjlcHr/ADlGufXh2U8mXvo61d2Ecs8LMkkf2fFEgwwPt6dtKHGfETU8ccQpqypSVxGPBUEJsTnlHy37aWb/AMTc95mnqIHoefzCN12XupIADD89SkqYbvasTMrxyDOQ3Jgf51Lm14NmP48OP2LduQVUcjsq%2bX7R230fjuFHQ0K19yI%2bjUoPhxYwGI6HHrpZpJGWmp%2bU8uWGcDGdCPifPL4MkfOfDDhQvpjSR8hZpaQbGH4cX64VEvFvFFVM4jEXli%2b60m/hr%2bnb8WsDjziJS6/xaUKrTDmCJnEaDf7Pq2dROGwIfhLTeGOXxrmgkx97Djr/ALR8tJquwolOTk0U7Z9zIcnTo822ootO1fEW7oeSurxIfpFIq80AJZWALjIwFyM7kH2xq4qioVWYcwG5A315VrvLDIw689Of1EZ16JrXYxxEkkkb/Ia40i4qze7pT1UUkU4jkjcFWV8EEH0OkjiDggQW1a7hl3iCDD0rOWT3xncH9tG6pjvvorwjK7XQQsxMT0zsynoSrKAf3OpaRoVwVpn/2Q==' /%3e%3c/svg%3e"}}},"context":{}}